{
  "_name_or_path": "C:\\Users\\Achraf\\bert_prod2\\src\\BertCname\\trained_model\\model",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": 434,
    "1": 435,
    "2": 433,
    "3": 294,
    "4": 535,
    "5": 418,
    "6": 432,
    "7": 862,
    "8": 716,
    "9": 429,
    "10": 420,
    "11": 715,
    "12": 411,
    "13": 610,
    "14": 721,
    "15": 473,
    "16": 585,
    "17": 590,
    "18": 450,
    "19": 720,
    "20": 419,
    "21": 413,
    "22": 592,
    "23": 606,
    "24": 717,
    "25": 439,
    "26": 533,
    "27": 443,
    "28": 712,
    "29": 612,
    "30": 416,
    "31": 415,
    "32": 367,
    "33": 598,
    "34": 1940,
    "35": 427,
    "36": 334,
    "37": 527,
    "38": 339,
    "39": 350,
    "40": 346,
    "41": 477,
    "42": 828,
    "43": 912,
    "44": 723,
    "45": 356,
    "46": 355,
    "47": 613,
    "48": 362,
    "49": 344,
    "50": 579,
    "51": 425,
    "52": 837,
    "53": 490,
    "54": 485,
    "55": 409,
    "56": 347,
    "57": 529,
    "58": 388,
    "59": 593,
    "60": 410,
    "61": 351,
    "62": 484,
    "63": 417,
    "64": 900,
    "65": 896,
    "66": 510,
    "67": 470,
    "68": 474,
    "69": 710,
    "70": 607,
    "71": 438,
    "72": 581,
    "73": 483,
    "74": 478,
    "75": 403,
    "76": 904,
    "77": 341,
    "78": 599,
    "79": 333,
    "80": 338,
    "81": 582,
    "82": 547,
    "83": 600,
    "84": 597,
    "85": 611,
    "86": 608,
    "87": 499,
    "88": 500,
    "89": 829,
    "90": 911,
    "91": 910,
    "92": 913,
    "93": 576,
    "94": 586,
    "95": 664,
    "96": 348,
    "97": 857,
    "98": 412,
    "99": 873,
    "100": 872,
    "101": 1924,
    "102": 453,
    "103": 709,
    "104": 711,
    "105": 1000,
    "106": 1001,
    "107": 1002,
    "108": 382,
    "109": 337,
    "110": 423,
    "111": 903,
    "112": 503,
    "113": 897,
    "114": 587,
    "115": 580,
    "116": 445,
    "117": 357,
    "118": 824,
    "119": 895,
    "120": 577,
    "121": 1005,
    "122": 1006,
    "123": 1009,
    "124": 1052,
    "125": 583,
    "126": 602,
    "127": 372,
    "128": 668,
    "129": 464,
    "130": 466,
    "131": 421,
    "132": 521,
    "133": 1915,
    "134": 672,
    "135": 1935,
    "136": 293,
    "137": 835,
    "138": 386,
    "139": 446,
    "140": 468,
    "141": 1936,
    "142": 591,
    "143": 665,
    "144": 447,
    "145": 459,
    "146": 461,
    "147": 471,
    "148": 373,
    "149": 375,
    "150": 370,
    "151": 366,
    "152": 424,
    "153": 405,
    "154": 368,
    "155": 406,
    "156": 404,
    "157": 385,
    "158": 467,
    "159": 381,
    "160": 363,
    "161": 384,
    "162": 546,
    "163": 832,
    "164": 454,
    "165": 594,
    "166": 603,
    "167": 377,
    "168": 834,
    "169": 407,
    "170": 401,
    "171": 379,
    "172": 400,
    "173": 394,
    "174": 833,
    "175": 830,
    "176": 831,
    "177": 659,
    "178": 391,
    "179": 842,
    "180": 841,
    "181": 462,
    "182": 383,
    "183": 440,
    "184": 507,
    "185": 402,
    "186": 349,
    "187": 868,
    "188": 444,
    "189": 380,
    "190": 669,
    "191": 1923,
    "192": 1919,
    "193": 408,
    "194": 520,
    "195": 517,
    "196": 525,
    "197": 671,
    "198": 378,
    "199": 431,
    "200": 718,
    "201": 518,
    "202": 722,
    "203": 536,
    "204": 399,
    "205": 364,
    "206": 543,
    "207": 844,
    "208": 455,
    "209": 840,
    "210": 530,
    "211": 584,
    "212": 870,
    "213": 713,
    "214": 331,
    "215": 329,
    "216": 332,
    "217": 883,
    "218": 869,
    "219": 881,
    "220": 864,
    "221": 867,
    "222": 874,
    "223": 860,
    "224": 859,
    "225": 865,
    "226": 858,
    "227": 866,
    "228": 888,
    "229": 884,
    "230": 885,
    "231": 854,
    "232": 893,
    "233": 894,
    "234": 852,
    "235": 886,
    "236": 889,
    "237": 890,
    "238": 880,
    "239": 887,
    "240": 892,
    "241": 855,
    "242": 719,
    "243": 609,
    "244": 899,
    "245": 335,
    "246": 343,
    "247": 342,
    "248": 541,
    "249": 532,
    "250": 534,
    "251": 540,
    "252": 544,
    "253": 539,
    "254": 295,
    "255": 390,
    "256": 538,
    "257": 537,
    "258": 839,
    "259": 430,
    "260": 714,
    "261": 605,
    "262": 657,
    "263": 393,
    "264": 392,
    "265": 656,
    "266": 663,
    "267": 395,
    "268": 389,
    "269": 451,
    "270": 481,
    "271": 661,
    "272": 660,
    "273": 662,
    "274": 512,
    "275": 422,
    "276": 542,
    "277": 469,
    "278": 843,
    "279": 448,
    "280": 442,
    "281": 428,
    "282": 460,
    "283": 519,
    "284": 667,
    "285": 495,
    "286": 511,
    "287": 387,
    "288": 670,
    "289": 502,
    "290": 312,
    "291": 666,
    "292": 353,
    "293": 314,
    "294": 508,
    "295": 369,
    "296": 578,
    "297": 354,
    "298": 358,
    "299": 1918,
    "300": 1921,
    "301": 524,
    "302": 526,
    "303": 336,
    "304": 882,
    "305": 313,
    "306": 876,
    "307": 878,
    "308": 877,
    "309": 879,
    "310": 497,
    "311": 838,
    "312": 449,
    "313": 509,
    "314": 531,
    "315": 898,
    "316": 1928,
    "317": 875,
    "318": 856,
    "319": 513,
    "320": 523,
    "321": 426,
    "322": 528,
    "323": 902,
    "324": 891,
    "325": 871,
    "326": 853,
    "327": 1933,
    "328": 1932,
    "329": 1922,
    "330": 1934,
    "331": 1927,
    "332": 494,
    "333": 1929,
    "334": 1403
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "293": 136,
    "294": 3,
    "295": 254,
    "312": 290,
    "313": 305,
    "314": 293,
    "329": 215,
    "331": 214,
    "332": 216,
    "333": 79,
    "334": 36,
    "335": 245,
    "336": 303,
    "337": 109,
    "338": 80,
    "339": 38,
    "341": 77,
    "342": 247,
    "343": 246,
    "344": 49,
    "346": 40,
    "347": 56,
    "348": 96,
    "349": 186,
    "350": 39,
    "351": 61,
    "353": 292,
    "354": 297,
    "355": 46,
    "356": 45,
    "357": 117,
    "358": 298,
    "362": 48,
    "363": 160,
    "364": 205,
    "366": 151,
    "367": 32,
    "368": 154,
    "369": 295,
    "370": 150,
    "372": 127,
    "373": 148,
    "375": 149,
    "377": 167,
    "378": 198,
    "379": 171,
    "380": 189,
    "381": 159,
    "382": 108,
    "383": 182,
    "384": 161,
    "385": 157,
    "386": 138,
    "387": 287,
    "388": 58,
    "389": 268,
    "390": 255,
    "391": 178,
    "392": 264,
    "393": 263,
    "394": 173,
    "395": 267,
    "399": 204,
    "400": 172,
    "401": 170,
    "402": 185,
    "403": 75,
    "404": 156,
    "405": 153,
    "406": 155,
    "407": 169,
    "408": 193,
    "409": 55,
    "410": 60,
    "411": 12,
    "412": 98,
    "413": 21,
    "415": 31,
    "416": 30,
    "417": 63,
    "418": 5,
    "419": 20,
    "420": 10,
    "421": 131,
    "422": 275,
    "423": 110,
    "424": 152,
    "425": 51,
    "426": 321,
    "427": 35,
    "428": 281,
    "429": 9,
    "430": 259,
    "431": 199,
    "432": 6,
    "433": 2,
    "434": 0,
    "435": 1,
    "438": 71,
    "439": 25,
    "440": 183,
    "442": 280,
    "443": 27,
    "444": 188,
    "445": 116,
    "446": 139,
    "447": 144,
    "448": 279,
    "449": 312,
    "450": 18,
    "451": 269,
    "453": 102,
    "454": 164,
    "455": 208,
    "459": 145,
    "460": 282,
    "461": 146,
    "462": 181,
    "464": 129,
    "466": 130,
    "467": 158,
    "468": 140,
    "469": 277,
    "470": 67,
    "471": 147,
    "473": 15,
    "474": 68,
    "477": 41,
    "478": 74,
    "481": 270,
    "483": 73,
    "484": 62,
    "485": 54,
    "490": 53,
    "494": 332,
    "495": 285,
    "497": 310,
    "499": 87,
    "500": 88,
    "502": 289,
    "503": 112,
    "507": 184,
    "508": 294,
    "509": 313,
    "510": 66,
    "511": 286,
    "512": 274,
    "513": 319,
    "517": 195,
    "518": 201,
    "519": 283,
    "520": 194,
    "521": 132,
    "523": 320,
    "524": 301,
    "525": 196,
    "526": 302,
    "527": 37,
    "528": 322,
    "529": 57,
    "530": 210,
    "531": 314,
    "532": 249,
    "533": 26,
    "534": 250,
    "535": 4,
    "536": 203,
    "537": 257,
    "538": 256,
    "539": 253,
    "540": 251,
    "541": 248,
    "542": 276,
    "543": 206,
    "544": 252,
    "546": 162,
    "547": 82,
    "576": 93,
    "577": 120,
    "578": 296,
    "579": 50,
    "580": 115,
    "581": 72,
    "582": 81,
    "583": 125,
    "584": 211,
    "585": 16,
    "586": 94,
    "587": 114,
    "590": 17,
    "591": 142,
    "592": 22,
    "593": 59,
    "594": 165,
    "597": 84,
    "598": 33,
    "599": 78,
    "600": 83,
    "602": 126,
    "603": 166,
    "605": 261,
    "606": 23,
    "607": 70,
    "608": 86,
    "609": 243,
    "610": 13,
    "611": 85,
    "612": 29,
    "613": 47,
    "656": 265,
    "657": 262,
    "659": 177,
    "660": 272,
    "661": 271,
    "662": 273,
    "663": 266,
    "664": 95,
    "665": 143,
    "666": 291,
    "667": 284,
    "668": 128,
    "669": 190,
    "670": 288,
    "671": 197,
    "672": 134,
    "709": 103,
    "710": 69,
    "711": 104,
    "712": 28,
    "713": 213,
    "714": 260,
    "715": 11,
    "716": 8,
    "717": 24,
    "718": 200,
    "719": 242,
    "720": 19,
    "721": 14,
    "722": 202,
    "723": 44,
    "824": 118,
    "828": 42,
    "829": 89,
    "830": 175,
    "831": 176,
    "832": 163,
    "833": 174,
    "834": 168,
    "835": 137,
    "837": 52,
    "838": 311,
    "839": 258,
    "840": 209,
    "841": 180,
    "842": 179,
    "843": 278,
    "844": 207,
    "852": 234,
    "853": 326,
    "854": 231,
    "855": 241,
    "856": 318,
    "857": 97,
    "858": 226,
    "859": 224,
    "860": 223,
    "862": 7,
    "864": 220,
    "865": 225,
    "866": 227,
    "867": 221,
    "868": 187,
    "869": 218,
    "870": 212,
    "871": 325,
    "872": 100,
    "873": 99,
    "874": 222,
    "875": 317,
    "876": 306,
    "877": 308,
    "878": 307,
    "879": 309,
    "880": 238,
    "881": 219,
    "882": 304,
    "883": 217,
    "884": 229,
    "885": 230,
    "886": 235,
    "887": 239,
    "888": 228,
    "889": 236,
    "890": 237,
    "891": 324,
    "892": 240,
    "893": 232,
    "894": 233,
    "895": 119,
    "896": 65,
    "897": 113,
    "898": 315,
    "899": 244,
    "900": 64,
    "902": 323,
    "903": 111,
    "904": 76,
    "910": 91,
    "911": 90,
    "912": 43,
    "913": 92,
    "1000": 105,
    "1001": 106,
    "1002": 107,
    "1005": 121,
    "1006": 122,
    "1009": 123,
    "1052": 124,
    "1403": 334,
    "1915": 133,
    "1918": 299,
    "1919": 192,
    "1921": 300,
    "1922": 329,
    "1923": 191,
    "1924": 101,
    "1927": 331,
    "1928": 316,
    "1929": 333,
    "1932": 328,
    "1933": 327,
    "1934": 330,
    "1935": 135,
    "1936": 141,
    "1940": 34
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "transformers_version": "4.9.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
